CSI API ETABS v1
cSpandrelLabel.GetNameList Method
 Retrieves the names of all defined Spandrel Labels
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName,
	ref bool[] IsMultiStory
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef IsMultiStory As Boolean()
) As Integer
Dim instance As cSpandrelLabel
Dim NumberNames As Integer
Dim MyName As String()
Dim IsMultiStory As Boolean()
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName, IsMultiStory)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName,
	array<bool>^% IsMultiStory
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref *
        IsMultiStory : bool[] byref -> int
Parameters
NumberNames
Type: System.Int32
 The number of Spandrel Labels defined in the program
MyName
Type: System.String[]
 This is a one-dimensional array of coordinate system names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the ETABS program, filled with the names, and returned to the API user.
IsMultiStory
Type: System.Boolean[]
 This values of this array are True or False, indicating whether the associated Spandrel Label spans multiple story levels
Return Value
Type: Int32
 Returns zero if the names are successfully retrieved, otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim NumberNames As Integer
   Dim MyName As String()
   Dim IsMultiStory As Boolean()
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel", False)
'get names
    ret = SapModel.SpandrelLabel.GetNameList(NumberNames, MyName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cSpandrelLabel Interface
ETABSv1 Namespace